{
    "风险评估结果": {
        "error_message": "",
        "success": true,
        "统计推断还原率": 0.0,
        "重识别率": 0.05
    },
    "合规性评估结果": {
        "(α,k)-Anonymity": [
            "隐私属性hotel_name满足(0.5,2)-Anonymity"
        ],
        "K-Anonymity": "满足2-匿名",
        "L-Diversity": [
            "隐私属性 hotel_name 满足2-多样性"
        ],
        "T-Closeness": [
            "隐私属性hotel_name满足0.95-紧密性"
        ],
        "error_message": "",
        "success": true
    },
    "可用性评估结果": {
        "error_message": "",
        "success": true,
        "基于熵的平均数据损失度": "48.43%",
        "归一化平均等价组大小度量": 94.697,
        "数据可辨别度": 31689984,
        "数据记录匿名率": "0.0%"
    },
    "匿名集数据特征评估结果": {
        "error_message": "",
        "success": true,
        "准标识符维数": 4,
        "固有隐私": 378,
        "平均泛化程度": 189.3939,
        "敏感属性种类": [
            "hotel_name"
        ],
        "敏感属性维数": 1
    },
    "匿名集数据质量评估结果": {
        "KL_Divergence": [
            "数据集针对hotel_name的KL散度为：3.8502,对应等价组为('女', '50-100', '12****************', '14********')"
        ],
        "error_message": "",
        "success": true,
        "分布泄露": [
            "数据集针对hotel_name的分布泄露为：0.3622,对应等价组为('女', '50-100', '12****************', '14********')"
        ],
        "唯一性": "0.0%",
        "正面信息披露": [
            "数据集针对hotel_name的正面信息披露为：95.8829,对应属性值为斯维登酒店"
        ],
        "熵泄露": [
            "数据集针对hotel_name的熵泄露为：3.8082,对应等价组为('女', '50-100', '12****************', '14********')"
        ]
    },
    "隐私保护性度量评估结果": {
        "error_message": "",
        "success": true,
        "单个属性的重识别风险": [
            "针对准标识符属性sex基于熵的重识别风险为：0.19%，对应属性值为男",
            "针对准标识符属性age基于熵的重识别风险为：0.21%，对应属性值为50-100",
            "针对准标识符属性id_number基于熵的重识别风险为：0.66%，对应属性值为46****************",
            "针对准标识符属性phone基于熵的重识别风险为：0.34%，对应属性值为14********"
        ],
        "基于熵的重识别风险": "整个数据集基于熵的重识别风险为：56.66%，对应等价组为('男', '0-50', '65****************', '13********')",
        "敏感属性的重识别风险": [
            "针对敏感属性hotel_name基于熵的重识别风险为：56.66%，对应等价组为('女', '50-100', '12****************', '14********')"
        ]
    }
}
